{
  "bodyParts": [
    {
      "id": "heart",
      "name": "Heart",
      "system": "Cardiovascular System",
      "description": "The heart is a muscular organ about the size of your fist that pumps blood throughout your body. It's located slightly left of center in your chest.",
      "function": "The heart pumps blood through the circulatory system, delivering oxygen and nutrients to tissues and removing carbon dioxide and other wastes.",
      "funFacts": [
        "Your heart beats about 100,000 times per day",
        "The heart pumps about 2,000 gallons of blood daily",
        "A woman's heart beats slightly faster than a man's",
        "The heart has its own electrical system",
        "Laughing is good for your heart - it reduces stress and boosts immunity"
      ],
      "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e5/Diagram_of_the_human_heart_%28cropped%29.svg/400px-Diagram_of_the_human_heart_%28cropped%29.svg.png"
    },
    {
      "id": "brain",
      "name": "Brain",
      "system": "Nervous System",
      "description": "The brain is the most complex organ in the human body. It controls thought, memory, emotion, touch, motor skills, vision, breathing, and every process that regulates our body.",
      "function": "The brain processes sensory information, controls body functions, enables thinking, learning, and memory, and regulates emotions and behavior.",
      "funFacts": [
        "The brain weighs about 3 pounds (1.4 kg)",
        "It contains approximately 86 billion neurons",
        "The brain uses about 20% of the body's total energy",
        "Your brain generates enough electricity to power a small light bulb",
        "The brain is 73% water"
      ],
      "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1a/Gray728.svg/400px-Gray728.svg.png"
    },
    {
      "id": "lungs",
      "name": "Lungs",
      "system": "Respiratory System",
      "description": "The lungs are a pair of spongy, air-filled organs located on either side of the chest. The right lung has three lobes, while the left lung has two to make room for the heart.",
      "function": "The lungs facilitate gas exchange - they bring oxygen into the body when you inhale and release carbon dioxide when you exhale.",
      "funFacts": [
        "If spread flat, your lungs would cover an area the size of a tennis court",
        "You breathe about 20,000 times per day",
        "The left lung is smaller than the right to make room for the heart",
        "Lungs can float on water because they contain air",
        "Children and women breathe faster than men"
      ],
      "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Lungs_diagram_detailed.svg/400px-Lungs_diagram_detailed.svg.png"
    },
    {
      "id": "liver",
      "name": "Liver",
      "system": "Digestive System",
      "description": "The liver is the largest internal organ and gland in the human body. It's located in the upper right portion of the abdomen, beneath the diaphragm.",
      "function": "The liver filters blood, produces bile for digestion, stores nutrients, metabolizes drugs and toxins, and produces proteins essential for blood clotting.",
      "funFacts": [
        "The liver performs over 500 different functions",
        "It can regenerate itself - even if 75% is removed, it can grow back",
        "The liver holds about 13% of the body's blood supply",
        "It produces about 1 liter of bile per day",
        "The liver is the only organ that can completely regenerate"
      ],
      "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a5/Liver.svg/400px-Liver.svg.png"
    },
    {
      "id": "stomach",
      "name": "Stomach",
      "system": "Digestive System",
      "description": "The stomach is a muscular, hollow organ in the upper abdomen that plays a crucial role in digestion. It receives food from the esophagus and begins breaking it down.",
      "function": "The stomach stores food, mixes it with digestive juices, and slowly empties its contents into the small intestine. It produces acid and enzymes to break down food.",
      "funFacts": [
        "The stomach can stretch to hold up to 1 liter of food",
        "It produces a new layer of mucus every two weeks to protect itself from its own acid",
        "Stomach acid is strong enough to dissolve metal",
        "Your stomach gets a new lining every 3-4 days",
        "Blushing causes your stomach lining to turn red too"
      ],
      "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d4/Stomach_diagram.svg/400px-Stomach_diagram.svg.png"
    },
    {
      "id": "kidneys",
      "name": "Kidneys",
      "system": "Urinary System",
      "description": "The kidneys are two bean-shaped organs, each about the size of a fist, located just below the rib cage on each side of the spine.",
      "function": "The kidneys filter blood to remove waste and excess fluid, regulate blood pressure, produce hormones, and maintain the body's chemical balance.",
      "funFacts": [
        "Kidneys filter about 200 liters of blood daily",
        "Each kidney contains about 1 million tiny filters called nephrons",
        "You can live with just one kidney",
        "Kidneys are responsible for activating Vitamin D",
        "About 1-2 liters of urine is produced daily"
      ],
      "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8e/Kidney_Cross_Section.png/400px-Kidney_Cross_Section.png"
    },
    {
      "id": "intestines",
      "name": "Intestines",
      "system": "Digestive System",
      "description": "The intestines consist of the small intestine and large intestine. They form a long, continuous tube that processes food and absorbs nutrients.",
      "function": "The small intestine absorbs most nutrients from food. The large intestine absorbs water and electrolytes, and forms and stores feces until elimination.",
      "funFacts": [
        "The small intestine is about 20 feet long",
        "The large intestine is about 5 feet long",
        "Your gut contains trillions of bacteria - the gut microbiome",
        "The intestines have their own nervous system called the 'enteric nervous system'",
        "Food takes 6-8 hours to pass through the stomach and small intestine"
      ],
      "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c5/Intestine-diagram.svg/400px-Intestine-diagram.svg.png"
    },
    {
      "id": "skeleton",
      "name": "Skeleton",
      "system": "Skeletal System",
      "description": "The human skeleton is the internal framework of the body. It is composed of around 270 bones at birth, which decreases to about 206 bones by adulthood.",
      "function": "The skeleton provides support and shape to the body, protects internal organs, allows movement, produces blood cells, and stores minerals.",
      "funFacts": [
        "Babies are born with about 270 bones, but adults have only 206",
        "The smallest bone is in your ear (the stirrup/stapes)",
        "The femur is the longest and strongest bone",
        "Bones are constantly being rebuilt throughout your life",
        "Your skeleton completely replaces itself every 10 years"
      ],
      "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6e/Human_skeleton_front_en.svg/300px-Human_skeleton_front_en.svg.png"
    }
  ]
}
